{
  "barbarian": {
    "features": [
      {"level":1,"name":"Rage","description":"In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain advantage on Strength checks and Strength saving throws, a bonus to melee damage rolls (+2 at 1st, +3 at 9th, +4 at 16th), resistance to bludgeoning, piercing, and slashing damage, and you can't cast spells or concentrate on them. Your rage lasts for 1 minute. Rages per long rest: 2 at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, 6 at 17th, unlimited at 20th."},
      {"level":1,"name":"Unarmored Defense","description":"While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."},
      {"level":2,"name":"Reckless Attack","description":"Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."},
      {"level":2,"name":"Danger Sense","description":"At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated."},
      {"level":3,"name":"Primal Path","description":"At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. Alternatively, you can choose a feat."},
      {"level":5,"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."},
      {"level":5,"name":"Fast Movement","description":"Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."},
      {"level":7,"name":"Feral Instinct","description":"By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."},
      {"level":9,"name":"Brutal Critical","description":"Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level."},
      {"level":11,"name":"Relentless Rage","description":"Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."},
      {"level":15,"name":"Persistent Rage","description":"Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."},
      {"level":18,"name":"Indomitable Might","description":"Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."},
      {"level":20,"name":"Primal Champion","description":"At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."}
    ],
    "subclassLevel": 3,
    "spellSlots": null
  },
  "bard": {
    "features": [
      {"level":1,"name":"Spellcasting","description":"You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations. You use Charisma as your spellcasting ability."},
      {"level":1,"name":"Bardic Inspiration","description":"You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. The creature can add the die to one ability check, attack roll, or saving throw it makes. The die becomes d8 at 5th, d10 at 10th, and d12 at 15th level. Uses equal Charisma modifier per long rest."},
      {"level":2,"name":"Jack of All Trades","description":"Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus."},
      {"level":2,"name":"Song of Rest","description":"Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra hit points increase to 1d8 at 9th, 1d10 at 13th, and 1d12 at 17th level."},
      {"level":3,"name":"Bard College","description":"At 3rd level, you delve into the advanced techniques of a bard college of your choice. Your choice grants you features at 3rd level and again at 6th and 14th level."},
      {"level":3,"name":"Expertise","description":"At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 10th level, you can choose another two skill proficiencies to gain this benefit."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":5,"name":"Font of Inspiration","description":"Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."},
      {"level":6,"name":"Countercharm","description":"At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed."},
      {"level":10,"name":"Magical Secrets","description":"By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast. The chosen spells count as bard spells for you. You learn two additional spells from any class at 14th level and again at 18th level."},
      {"level":20,"name":"Superior Inspiration","description":"At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."}
    ],
    "subclassLevel": 3,
    "spellSlots": {"1":{"cantrips":2,"1":2},"2":{"cantrips":2,"1":3},"3":{"cantrips":2,"1":4,"2":2},"4":{"cantrips":3,"1":4,"2":3},"5":{"cantrips":3,"1":4,"2":3,"3":2},"6":{"cantrips":3,"1":4,"2":3,"3":3},"7":{"cantrips":3,"1":4,"2":3,"3":3,"4":1},"8":{"cantrips":3,"1":4,"2":3,"3":3,"4":2},"9":{"cantrips":3,"1":4,"2":3,"3":3,"4":3,"5":1},"10":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2},"11":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"12":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"13":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"14":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"15":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"16":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"17":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1,"9":1},"18":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":3,"6":1,"7":1,"8":1,"9":1},"19":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":1,"8":1,"9":1},"20":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":2,"8":1,"9":1}}
  },
  "cleric": {
    "features": [
      {"level":1,"name":"Spellcasting","description":"As a conduit for divine power, you can cast cleric spells. Wisdom is your spellcasting ability for your cleric spells. You prepare the list of cleric spells that are available for you to cast each day."},
      {"level":1,"name":"Divine Domain","description":"Choose one domain related to your deity. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels."},
      {"level":2,"name":"Channel Divinity","description":"At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Uses: 1 per rest at 2nd level, 2 at 6th, 3 at 18th."},
      {"level":2,"name":"Channel Divinity: Turn Undead","description":"As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet must make a Wisdom saving throw. If the creature fails, it is turned for 1 minute or until it takes damage. At 5th level, undead of CR 1/2 or lower are destroyed instead, increasing at higher levels."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":5,"name":"Destroy Undead","description":"Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold. CR 1/2 at 5th, CR 1 at 8th, CR 2 at 11th, CR 3 at 14th, CR 4 at 17th."},
      {"level":10,"name":"Divine Intervention","description":"Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. As an action, describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. At 20th level, your call for intervention succeeds automatically."}
    ],
    "subclassLevel": 1,
    "spellSlots": {"1":{"cantrips":3,"1":2},"2":{"cantrips":3,"1":3},"3":{"cantrips":3,"1":4,"2":2},"4":{"cantrips":4,"1":4,"2":3},"5":{"cantrips":4,"1":4,"2":3,"3":2},"6":{"cantrips":4,"1":4,"2":3,"3":3},"7":{"cantrips":4,"1":4,"2":3,"3":3,"4":1},"8":{"cantrips":4,"1":4,"2":3,"3":3,"4":2},"9":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":1},"10":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2},"11":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"12":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"13":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"14":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"15":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"16":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"17":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1,"9":1},"18":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":3,"6":1,"7":1,"8":1,"9":1},"19":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":1,"8":1,"9":1},"20":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":2,"8":1,"9":1}}
  },
  "druid": {
    "features": [
      {"level":1,"name":"Druidic","description":"You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages."},
      {"level":1,"name":"Spellcasting","description":"Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. Wisdom is your spellcasting ability."},
      {"level":2,"name":"Wild Shape","description":"Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice per short or long rest. Your druid level determines the beasts you can transform into: max CR 1/4 (no flying/swimming) at 2nd, CR 1/2 (no flying) at 4th, CR 1 at 8th."},
      {"level":2,"name":"Druid Circle","description":"At 2nd level, you choose to identify with a circle of druids. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":18,"name":"Timeless Body","description":"Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."},
      {"level":18,"name":"Beast Spells","description":"Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape."},
      {"level":20,"name":"Archdruid","description":"At 20th level, you can use your Wild Shape an unlimited number of times. Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell."}
    ],
    "subclassLevel": 2,
    "spellSlots": {"1":{"cantrips":2,"1":2},"2":{"cantrips":2,"1":3},"3":{"cantrips":2,"1":4,"2":2},"4":{"cantrips":3,"1":4,"2":3},"5":{"cantrips":3,"1":4,"2":3,"3":2},"6":{"cantrips":3,"1":4,"2":3,"3":3},"7":{"cantrips":3,"1":4,"2":3,"3":3,"4":1},"8":{"cantrips":3,"1":4,"2":3,"3":3,"4":2},"9":{"cantrips":3,"1":4,"2":3,"3":3,"4":3,"5":1},"10":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2},"11":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"12":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"13":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"14":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"15":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"16":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"17":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1,"9":1},"18":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":3,"6":1,"7":1,"8":1,"9":1},"19":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":1,"8":1,"9":1},"20":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":2,"8":1,"9":1}}
  },
  "fighter": {
    "features": [
      {"level":1,"name":"Fighting Style","description":"You adopt a particular style of fighting as your specialty. Choose one: Archery (+2 to ranged attack rolls), Defense (+1 AC while wearing armor), Dueling (+2 damage with one-handed weapon), Great Weapon Fighting (reroll 1s and 2s on damage with two-handed weapons), Protection (impose disadvantage on attacks against allies with shield), or Two-Weapon Fighting (add ability modifier to off-hand damage)."},
      {"level":1,"name":"Second Wind","description":"You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."},
      {"level":2,"name":"Action Surge","description":"Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest."},
      {"level":3,"name":"Martial Archetype","description":"At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Your archetype grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":5,"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level."},
      {"level":9,"name":"Indomitable","description":"Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."}
    ],
    "subclassLevel": 3,
    "spellSlots": null
  },
  "monk": {
    "features": [
      {"level":1,"name":"Unarmored Defense","description":"Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."},
      {"level":1,"name":"Martial Arts","description":"At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons. You gain benefits: use DEX instead of STR for monk weapon attacks, roll a d4 in place of normal damage (increases at higher levels: d6 at 5th, d8 at 11th, d10 at 17th), when you use the Attack action with an unarmed strike or monk weapon, you can make one unarmed strike as a bonus action."},
      {"level":2,"name":"Ki","description":"Starting at 2nd level, your training allows you to harness the mystic energy of ki. You have a number of ki points equal to your monk level. You can spend these points to fuel various ki features: Flurry of Blows (2 unarmed strikes as bonus action for 1 ki), Patient Defense (Dodge as bonus action for 1 ki), Step of the Wind (Disengage or Dash as bonus action for 1 ki, jump distance doubled)."},
      {"level":2,"name":"Unarmored Movement","description":"Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases at higher levels: +15 ft at 6th, +20 ft at 10th, +25 ft at 14th, +30 ft at 18th. At 9th level, you gain the ability to move along vertical surfaces and across liquids without falling during the move."},
      {"level":3,"name":"Monastic Tradition","description":"When you reach 3rd level, you commit yourself to a monastic tradition. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level."},
      {"level":3,"name":"Deflect Missiles","description":"Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. The damage you take is reduced by 1d10 + your Dexterity modifier + your monk level. If you reduce the damage to 0, you can catch the missile and spend 1 ki to make a ranged attack with it."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":4,"name":"Slow Fall","description":"Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."},
      {"level":5,"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."},
      {"level":5,"name":"Stunning Strike","description":"Starting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn."},
      {"level":6,"name":"Ki-Empowered Strikes","description":"Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."},
      {"level":7,"name":"Evasion","description":"At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."},
      {"level":7,"name":"Stillness of Mind","description":"Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened."},
      {"level":10,"name":"Purity of Body","description":"At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison."},
      {"level":13,"name":"Tongue of the Sun and Moon","description":"Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."},
      {"level":14,"name":"Diamond Soul","description":"Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws. Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."},
      {"level":15,"name":"Timeless Body","description":"At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. You also no longer need food or water."},
      {"level":18,"name":"Empty Body","description":"Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components, targeting only yourself."},
      {"level":20,"name":"Perfect Self","description":"At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points."}
    ],
    "subclassLevel": 3,
    "spellSlots": null
  },
  "paladin": {
    "features": [
      {"level":1,"name":"Divine Sense","description":"The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you. Uses: 1 + Charisma modifier per long rest."},
      {"level":1,"name":"Lay on Hands","description":"Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level x 5. Alternatively, you can expend 5 hit points from your pool of healing to cure one disease or neutralize one poison."},
      {"level":2,"name":"Fighting Style","description":"At 2nd level, you adopt a style of fighting as your specialty. Choose one: Defense, Dueling, Great Weapon Fighting, or Protection."},
      {"level":2,"name":"Spellcasting","description":"By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. Charisma is your spellcasting ability. You prepare spells from the paladin spell list."},
      {"level":2,"name":"Divine Smite","description":"Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend."},
      {"level":3,"name":"Divine Health","description":"By 3rd level, the divine magic flowing through you makes you immune to disease."},
      {"level":3,"name":"Sacred Oath","description":"When you reach 3rd level, you swear the oath that binds you as a paladin forever. Your oath grants you features at 3rd, 7th, 15th, and 20th level."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":5,"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."},
      {"level":6,"name":"Aura of Protection","description":"Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). At 18th level, the range of this aura increases to 30 feet."},
      {"level":10,"name":"Aura of Courage","description":"Starting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious. At 18th level, the range of this aura increases to 30 feet."},
      {"level":11,"name":"Improved Divine Smite","description":"By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage."},
      {"level":14,"name":"Cleansing Touch","description":"Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (minimum of once). You regain expended uses when you finish a long rest."}
    ],
    "subclassLevel": 3,
    "spellSlots": {"2":{"1":2},"3":{"1":3},"4":{"1":3},"5":{"1":4,"2":2},"6":{"1":4,"2":2},"7":{"1":4,"2":3},"8":{"1":4,"2":3},"9":{"1":4,"2":3,"3":2},"10":{"1":4,"2":3,"3":2},"11":{"1":4,"2":3,"3":3},"12":{"1":4,"2":3,"3":3},"13":{"1":4,"2":3,"3":3,"4":1},"14":{"1":4,"2":3,"3":3,"4":1},"15":{"1":4,"2":3,"3":3,"4":2},"16":{"1":4,"2":3,"3":3,"4":2},"17":{"1":4,"2":3,"3":3,"4":3,"5":1},"18":{"1":4,"2":3,"3":3,"4":3,"5":1},"19":{"1":4,"2":3,"3":3,"4":3,"5":2},"20":{"1":4,"2":3,"3":3,"4":3,"5":2}}
  },
  "ranger": {
    "features": [
      {"level":1,"name":"Favored Enemy","description":"Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. You choose one additional favored enemy at 6th and 14th level."},
      {"level":1,"name":"Natural Explorer","description":"You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain. Your proficiency bonus is doubled for proficient Intelligence or Wisdom checks related to it. Various travel benefits apply in that terrain. You choose additional favored terrain types at 6th and 10th level."},
      {"level":2,"name":"Fighting Style","description":"At 2nd level, you adopt a particular style of fighting as your specialty. Choose one: Archery, Defense, Dueling, or Two-Weapon Fighting."},
      {"level":2,"name":"Spellcasting","description":"By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. Wisdom is your spellcasting ability."},
      {"level":3,"name":"Ranger Archetype","description":"At 3rd level, you choose an archetype that you strive to emulate. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level."},
      {"level":3,"name":"Primeval Awareness","description":"Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":5,"name":"Extra Attack","description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."},
      {"level":8,"name":"Land's Stride","description":"Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them."},
      {"level":10,"name":"Hide in Plain Sight","description":"Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions."},
      {"level":14,"name":"Vanish","description":"Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."},
      {"level":18,"name":"Feral Senses","description":"At 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you."},
      {"level":20,"name":"Foe Slayer","description":"At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies."}
    ],
    "subclassLevel": 3,
    "spellSlots": {"2":{"1":2},"3":{"1":3},"4":{"1":3},"5":{"1":4,"2":2},"6":{"1":4,"2":2},"7":{"1":4,"2":3},"8":{"1":4,"2":3},"9":{"1":4,"2":3,"3":2},"10":{"1":4,"2":3,"3":2},"11":{"1":4,"2":3,"3":3},"12":{"1":4,"2":3,"3":3},"13":{"1":4,"2":3,"3":3,"4":1},"14":{"1":4,"2":3,"3":3,"4":1},"15":{"1":4,"2":3,"3":3,"4":2},"16":{"1":4,"2":3,"3":3,"4":2},"17":{"1":4,"2":3,"3":3,"4":3,"5":1},"18":{"1":4,"2":3,"3":3,"4":3,"5":1},"19":{"1":4,"2":3,"3":3,"4":3,"5":2},"20":{"1":4,"2":3,"3":3,"4":3,"5":2}}
  },
  "rogue": {
    "features": [
      {"level":1,"name":"Expertise","description":"At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 6th level, you can choose two more proficiencies to gain this benefit."},
      {"level":1,"name":"Sneak Attack","description":"Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or ranged weapon. You don't need advantage if another enemy of the target is within 5 feet of it. The extra damage increases as you gain levels: 2d6 at 3rd, 3d6 at 5th, etc., up to 10d6 at 19th level."},
      {"level":1,"name":"Thieves' Cant","description":"During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. It takes four times longer to convey such a message than it does to speak the same idea plainly."},
      {"level":2,"name":"Cunning Action","description":"Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."},
      {"level":3,"name":"Roguish Archetype","description":"At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 10th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":5,"name":"Uncanny Dodge","description":"Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."},
      {"level":7,"name":"Evasion","description":"Beginning at 7th level, you can nimbly dodge out of the way of certain area effects. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."},
      {"level":11,"name":"Reliable Talent","description":"By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."},
      {"level":14,"name":"Blindsense","description":"Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you."},
      {"level":15,"name":"Slippery Mind","description":"By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws."},
      {"level":18,"name":"Elusive","description":"Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't incapacitated."},
      {"level":20,"name":"Stroke of Luck","description":"At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can't use it again until you finish a short or long rest."}
    ],
    "subclassLevel": 3,
    "spellSlots": null
  },
  "sorcerer": {
    "features": [
      {"level":1,"name":"Spellcasting","description":"An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells. Charisma is your spellcasting ability for your sorcerer spells."},
      {"level":1,"name":"Sorcerous Origin","description":"Choose a sorcerous origin, which describes the source of your innate magical power. Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level."},
      {"level":2,"name":"Font of Magic","description":"At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects. You have 2 sorcery points, and you gain more as you reach higher levels (equal to your sorcerer level). You can use sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points."},
      {"level":3,"name":"Metamagic","description":"At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two Metamagic options of your choice. You gain another one at 10th and 17th level. Options include: Careful Spell, Distant Spell, Empowered Spell, Extended Spell, Heightened Spell, Quickened Spell, Subtle Spell, Twinned Spell."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":20,"name":"Sorcerous Restoration","description":"At 20th level, you regain 4 expended sorcery points whenever you finish a short rest."}
    ],
    "subclassLevel": 1,
    "spellSlots": {"1":{"cantrips":4,"1":2},"2":{"cantrips":4,"1":3},"3":{"cantrips":4,"1":4,"2":2},"4":{"cantrips":5,"1":4,"2":3},"5":{"cantrips":5,"1":4,"2":3,"3":2},"6":{"cantrips":5,"1":4,"2":3,"3":3},"7":{"cantrips":5,"1":4,"2":3,"3":3,"4":1},"8":{"cantrips":5,"1":4,"2":3,"3":3,"4":2},"9":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":1},"10":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2},"11":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"12":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"13":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"14":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"15":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"16":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"17":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1,"9":1},"18":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":3,"6":1,"7":1,"8":1,"9":1},"19":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":1,"8":1,"9":1},"20":{"cantrips":6,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":2,"8":1,"9":1}}
  },
  "warlock": {
    "features": [
      {"level":1,"name":"Otherworldly Patron","description":"At 1st level, you have struck a bargain with an otherworldly being of your choice. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level."},
      {"level":1,"name":"Pact Magic","description":"Your arcane research and the magic bestowed on you by your patron have given you facility with spells. You know two cantrips and can cast warlock spells using Charisma. Unlike other casters, you have a limited number of spell slots that recharge on a short rest. All spell slots are the same level (equal to your Pact Magic level)."},
      {"level":2,"name":"Eldritch Invocations","description":"In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. You gain two eldritch invocations of your choice. You learn additional invocations at higher levels."},
      {"level":3,"name":"Pact Boon","description":"At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice: Pact of the Chain (find familiar), Pact of the Blade (create a pact weapon), or Pact of the Tome (Book of Shadows with 3 cantrips)."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":11,"name":"Mystic Arcanum (6th level)","description":"At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. You gain additional arcana at higher levels: 7th-level at 13th, 8th-level at 15th, 9th-level at 17th."},
      {"level":20,"name":"Eldritch Master","description":"At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."}
    ],
    "subclassLevel": 1,
    "spellSlots": {"1":{"cantrips":2,"slots":1,"slotLevel":1},"2":{"cantrips":2,"slots":2,"slotLevel":1},"3":{"cantrips":2,"slots":2,"slotLevel":2},"4":{"cantrips":3,"slots":2,"slotLevel":2},"5":{"cantrips":3,"slots":2,"slotLevel":3},"6":{"cantrips":3,"slots":2,"slotLevel":3},"7":{"cantrips":3,"slots":2,"slotLevel":4},"8":{"cantrips":3,"slots":2,"slotLevel":4},"9":{"cantrips":3,"slots":2,"slotLevel":5},"10":{"cantrips":4,"slots":2,"slotLevel":5},"11":{"cantrips":4,"slots":3,"slotLevel":5},"12":{"cantrips":4,"slots":3,"slotLevel":5},"13":{"cantrips":4,"slots":3,"slotLevel":5},"14":{"cantrips":4,"slots":3,"slotLevel":5},"15":{"cantrips":4,"slots":3,"slotLevel":5},"16":{"cantrips":4,"slots":3,"slotLevel":5},"17":{"cantrips":4,"slots":4,"slotLevel":5},"18":{"cantrips":4,"slots":4,"slotLevel":5},"19":{"cantrips":4,"slots":4,"slotLevel":5},"20":{"cantrips":4,"slots":4,"slotLevel":5}}
  },
  "wizard": {
    "features": [
      {"level":1,"name":"Spellcasting","description":"As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. Intelligence is your spellcasting ability. You can prepare a number of wizard spells equal to your Intelligence modifier + your wizard level (minimum of one spell). You can cast wizard spells using your spell slots."},
      {"level":1,"name":"Arcane Recovery","description":"You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher."},
      {"level":2,"name":"Arcane Tradition","description":"When you reach 2nd level, you choose an arcane tradition, shaping your practice of magic. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."},
      {"level":4,"name":"Ability Score Improvement","description":"When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score by 2, or two ability scores by 1 (max 20). Alternatively, you can choose a feat."},
      {"level":18,"name":"Spell Mastery","description":"At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal."},
      {"level":20,"name":"Signature Spells","description":"When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest."}
    ],
    "subclassLevel": 2,
    "spellSlots": {"1":{"cantrips":3,"1":2},"2":{"cantrips":3,"1":3},"3":{"cantrips":3,"1":4,"2":2},"4":{"cantrips":4,"1":4,"2":3},"5":{"cantrips":4,"1":4,"2":3,"3":2},"6":{"cantrips":4,"1":4,"2":3,"3":3},"7":{"cantrips":4,"1":4,"2":3,"3":3,"4":1},"8":{"cantrips":4,"1":4,"2":3,"3":3,"4":2},"9":{"cantrips":4,"1":4,"2":3,"3":3,"4":3,"5":1},"10":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2},"11":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"12":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1},"13":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"14":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1},"15":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"16":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1},"17":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":2,"6":1,"7":1,"8":1,"9":1},"18":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":3,"6":1,"7":1,"8":1,"9":1},"19":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":1,"8":1,"9":1},"20":{"cantrips":5,"1":4,"2":3,"3":3,"4":3,"5":3,"6":2,"7":2,"8":1,"9":1}}
  }
}
