[
  {
    "id": "alert",
    "name": "Alert",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You gain the following benefits.\n- Initiative Proficiency. When you roll Initiative, you can add your proficiency bonus to the roll.\n- Initiative Swap. Immediately after you roll Initiative, you can swap your Initiative count with the Initiative count of one willing ally in the same combat. You can't make this swap if you or the ally has the Incapacitated condition.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "crafter",
    "name": "Crafter",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You are adept at crafting things and bargaining with merchants, gaining the following benefits:\n- Tool Proficiency. You gain proficiency with three different Artisan's Tools of your choice.\n- Discount. Whenever you buy a nonmagical item, you receive a 20 percent discount on it.\n- Fast Crafting. When you finish a Long Rest, you can craft one piece of gear from the Fast Crafting table, provided you have the Artisan's Tools associated with that item and have proficiency with those tools. The item lasts until you finish another Long Rest, at which point the item falls apart.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "healer",
    "name": "Healer",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You have the training and intuition to administer first aid and other care effectively, gaining the following benefits:\n- Battle Medic. If you have a Healer's Kit, you can take the Utilize action to tend to a creature within 5 feet of you, expending one use of the kit. That creature can expend one of its Hit Point Dice, and you then roll that die. The creature regains a number of Hit Points equal to the roll plus your Proficiency Bonus.\n- Healing Rerolls. Whenever you roll a die to determine the number of Hit Points you restore with a spell or with this feat's Battle Medic benefit, you can reroll the die if it rolls a 1, and you must use the new roll.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "lucky",
    "name": "Lucky",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You have inexplicable luck that can kick in at just the right moment, granting you the following benefits:\n- Luck Points. You have a number of Luck Points equal to your Proficiency Bonus. You regain your expended Luck Points when you finish a Long Rest.\n- Advantage. When you roll a d20 for a d20 Test, you can spend 1 Luck Point to give yourself Advantage on the roll.\n- Disadvantage. When a creature rolls a d20 for an attack roll against you, you can spend 1 Luck Point to impose Disadvantage on that roll.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "magic-initiate",
    "name": "Magic Initiate",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You have learned the basics of a particular magical tradition. Choose one spell list: Cleric, Druid, or Wizard. You gain the following benefits related to that choice:\n- Two Cantrips. You learn two cantrips of your choice from the chosen spell list.\n- Level 1 Spell. Choose one level 1 spell from the chosen spell list. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have.\n- Spell Change. Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list.\n- Spellcasting Ability. Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat).",
    "abilityScoreIncrease": null,
    "repeatable": true,
    "source": "2024 PHB"
  },
  {
    "id": "musician",
    "name": "Musician",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You are a practiced musician, gaining the following benefits:\n- Instrument Training. You gain proficiency with three Musical Instruments of your choice.\n- Inspiring Song. As you finish a Short or Long Rest, you can play a song on a Musical Instrument with which you have proficiency and give Heroic Inspiration to allies who hear the song. The number of allies you can affect in this way equals your Proficiency Bonus.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "savage-attacker",
    "name": "Savage Attacker",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You have trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon's damage dice twice and use either roll against the target.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "skilled",
    "name": "Skilled",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "You have exceptionally broad learning. You gain proficiency in any combination of three skills or tools of your choice.",
    "abilityScoreIncrease": null,
    "repeatable": true,
    "source": "2024 PHB"
  },
  {
    "id": "tavern-brawler",
    "name": "Tavern Brawler",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "Accustomed to brawling, you gain the following benefits:\n- Enhanced Unarmed Strike. When you hit with your Unarmed Strike and deal damage, you can deal Bludgeoning damage equal to 1d4 + your Strength modifier instead of the normal damage of an Unarmed Strike.\n- Damage Rerolls. Whenever you roll a damage die for your Unarmed Strike, you can reroll the die if it rolls a 1, and you must use the new roll.\n- Push. When you hit a creature with an Unarmed Strike as part of the Attack action on your turn, you can deal damage to the target and also push it 5 feet away from you. You can use this benefit only once per turn.\n- Improvised Weaponry. You have proficiency with improvised weapons.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "tough",
    "name": "Tough",
    "category": "Origin",
    "level": 1,
    "prerequisites": [],
    "description": "Your Hit Point maximum increases by an amount equal to twice your character level when you gain this feat. Whenever you gain a character level thereafter, your Hit Point maximum increases by an additional 2 Hit Points.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "ability-score-improvement",
    "name": "Ability Score Improvement",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You increase one Ability Score of your choice by 2, or you increase two Ability Scores of your choice by 1. This feat can't increase an Ability Score above 20.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 2
    },
    "repeatable": true,
    "source": "2024 PHB"
  },
  {
    "id": "actor",
    "name": "Actor",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Charisma 13 or higher"
    ],
    "description": "Skilled at mimicry and dramatics, you gain the following benefits:\n- Ability Score Increase. Increase your Charisma score by 1, to a maximum of 20.\n- Impersonation. While you're disguised as a real or fictional person, you have Advantage on Charisma (Deception or Performance) checks to convince others that you are that person.\n- Mimicry. You can mimic the sounds of other creatures, including speech. A creature that hears the sounds you make can tell they are imitations only with a successful Wisdom (Insight) check against a DC of 8 + your Charisma modifier + your Proficiency Bonus.",
    "abilityScoreIncrease": {
      "options": [
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "athlete",
    "name": "Athlete",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Strength or Dexterity 13 or higher"
    ],
    "description": "You have undergone extensive physical training, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Climb Speed. You gain a Climb Speed equal to your Speed.\n- Hop Up. When you are Prone, you can right yourself with only 5 feet of movement.\n- Jumping. You can make a running Long Jump or a running High Jump after moving only 5 feet on foot, rather than 10 feet.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "charger",
    "name": "Charger",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Strength or Dexterity 13 or higher"
    ],
    "description": "You have trained to charge headlong into battle, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Improved Dash. When you take the Dash action, your Speed increases by 10 feet for that action.\n- Charge Attack. If you move at least 10 feet in a straight line immediately before hitting with an attack as part of the Attack action on your turn, choose one of the following effects: the target takes an extra 1d8 damage from the attack, or the target is pushed up to 10 feet away from you. You can use this benefit only once on each of your turns.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "chef",
    "name": "Chef",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "Time spent mastering the culinary arts has paid off, granting you the following benefits:\n- Ability Score Increase. Increase your Constitution or Wisdom score by 1, to a maximum of 20.\n- Cook's Utensils. You gain proficiency with Cook's Utensils if you don't already have it.\n- Replenishing Meal. As part of a Short Rest, you can cook special food if you have Cook's Utensils and ingredients available. You can prepare enough of this food for a number of creatures equal to 4 + your Proficiency Bonus. At the end of the Short Rest, any creature who eats the food regains an extra number of Hit Points equal to your Proficiency Bonus.\n- Bolstering Treats. With 1 hour of work or when you finish a Long Rest, you can cook a number of treats equal to your Proficiency Bonus if you have Cook's Utensils and ingredients. These special treats last 8 hours. A creature can use a Bonus Action to eat one of these treats to gain Temporary Hit Points equal to your Proficiency Bonus.",
    "abilityScoreIncrease": {
      "options": [
        "Constitution",
        "Wisdom"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "crossbow-expert",
    "name": "Crossbow Expert",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Dexterity 13 or higher"
    ],
    "description": "Thanks to extensive practice with crossbows, you gain the following benefits:\n- Ability Score Increase. Increase your Dexterity score by 1, to a maximum of 20.\n- Ignore Loading. You ignore the Loading property of crossbows with which you are proficient.\n- No Disadvantage in Melee. Being within 5 feet of an enemy doesn't impose Disadvantage on your attack rolls with crossbows.\n- Dual Wielding. When you make the extra attack of the Light weapon property, you can add your ability modifier to the damage of the extra attack if that attack is with a crossbow that has the Light property.",
    "abilityScoreIncrease": {
      "options": [
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "crusher",
    "name": "Crusher",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You are practiced in the art of crushing your enemies, granting you the following benefits:\n- Ability Score Increase. Increase your Strength or Constitution score by 1, to a maximum of 20.\n- Push. Once per turn, when you hit a creature with an attack that deals Bludgeoning damage, you can push the creature 5 feet in a direction of your choice. A creature that is more than one size larger than you is unaffected.\n- Enhanced Critical. When you score a Critical Hit that deals Bludgeoning damage, attack rolls against the target have Advantage until the start of your next turn.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Constitution"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "defensive-duelist",
    "name": "Defensive Duelist",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Dexterity 13 or higher"
    ],
    "description": "You've learned to deftly parry attacks while wielding a Finesse weapon, gaining the following benefit:\n- Ability Score Increase. Increase your Dexterity score by 1, to a maximum of 20.\n- Parry. If you are holding a Finesse weapon and another creature hits you with a melee attack, you can use your Reaction to add your Proficiency Bonus to your Armor Class, potentially turning the hit into a miss. You gain this bonus to your AC against melee attacks until the start of your next turn.",
    "abilityScoreIncrease": {
      "options": [
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "dual-wielder",
    "name": "Dual Wielder",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Strength or Dexterity 13 or higher"
    ],
    "description": "You master fighting with two weapons, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Enhanced Dual Wielding. When you take the Attack action on your turn and attack with a weapon that has the Light property, you can make one extra attack as a Bonus Action later on the same turn with a different weapon, which must be a Melee weapon that lacks the Two-Handed property. You don't add your ability modifier to the extra attack's damage unless that modifier is negative.\n- Quick Draw. You can draw or stow two weapons that lack the Two-Handed property when you would normally be able to draw or stow only one.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "durable",
    "name": "Durable",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "Hardy and resilient, you gain the following benefits:\n- Ability Score Increase. Increase your Constitution score by 1, to a maximum of 20.\n- Defy Death. You have Advantage on Death Saving Throws.\n- Speedy Recovery. As a Bonus Action, you can expend one of your Hit Point Dice, roll the die, and regain a number of Hit Points equal to the roll.",
    "abilityScoreIncrease": {
      "options": [
        "Constitution"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "elemental-adept",
    "name": "Elemental Adept",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Spellcasting or Pact Magic feature"
    ],
    "description": "In your spellcasting, you can harness a particular form of energy with deadly mastery, granting you the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Energy Mastery. Choose one of the following damage types: Acid, Cold, Fire, Lightning, or Thunder. Spells you cast ignore Resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.\n- Repeatable. You can take this feat more than once, choosing a different damage type each time.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "repeatable": true,
    "choiceConfig": {
      "element": {
        "type": "element",
        "label": "Choose a damage type",
        "options": [
          "Acid",
          "Cold",
          "Fire",
          "Lightning",
          "Thunder"
        ]
      }
    },
    "source": "2024 PHB"
  },
  {
    "id": "fey-touched",
    "name": "Fey-Touched",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "Your exposure to the Feywild's magic has changed you, granting you the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Fey Magic. You learn the Misty Step spell and one level 1 spell of your choice. The level 1 spell must be from the Divination or Enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either spell in this way, you can't cast that spell in this way again until you finish a Long Rest. You can also cast these spells using spell slots you have of the appropriate level.\n- Spellcasting Ability. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat).",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "grappler",
    "name": "Grappler",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Strength or Dexterity 13 or higher"
    ],
    "description": "You gain the following benefits.\n- Punch and Grab. When you hit a creature with an Unarmed Strike as part of the Attack action on your turn, you can use both the damage and the grapple option. You can use this benefit only once per turn.\n- Attack Advantage. You have Advantage on attack rolls against a creature Grappled by you.\n- Fast Wrestler. You aren't Slowed when you move a creature Grappled by you if the creature is your size or smaller.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "great-weapon-master",
    "name": "Great Weapon Master",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Strength 13 or higher"
    ],
    "description": "You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:\n- Ability Score Increase. Increase your Strength score by 1, to a maximum of 20.\n- Heavy Weapon Mastery. When you hit a creature with a weapon that has the Heavy property as part of the Attack action on your turn, you can cause the weapon to deal extra damage to the target. The extra damage equals your Proficiency Bonus.\n- Hew. Immediately after you score a Critical Hit with a Melee weapon or reduce a creature to 0 Hit Points with one, you can make one attack with the same weapon as a Bonus Action.",
    "abilityScoreIncrease": {
      "options": [
        "Strength"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "heavily-armored",
    "name": "Heavily Armored",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Medium Armor Training"
    ],
    "description": "You have trained to master the use of heavy armor, gaining the following benefits:\n- Ability Score Increase. Increase your Constitution or Strength score by 1, to a maximum of 20.\n- Armor Training. You gain proficiency with Heavy Armor.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Constitution"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "heavy-armor-master",
    "name": "Heavy Armor Master",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Heavy Armor Training"
    ],
    "description": "You can use your Heavy Armor to deflect strikes, gaining the following benefits:\n- Ability Score Increase. Increase your Constitution or Strength score by 1, to a maximum of 20.\n- Damage Reduction. When you are hit by an attack while you are wearing Heavy Armor, any Bludgeoning, Piercing, or Slashing damage dealt to you by that attack is reduced by an amount equal to your Proficiency Bonus.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Constitution"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "inspiring-leader",
    "name": "Inspiring Leader",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Wisdom or Charisma 13 or higher"
    ],
    "description": "You inspire your companions, shoring up their resolve to fight. You gain the following benefits:\n- Ability Score Increase. Increase your Wisdom or Charisma score by 1, to a maximum of 20.\n- Encouraging Performance. At the end of a Short or Long Rest, you can give an inspiring performance: a speech, a song, or the like. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you who witness the performance. The chosen creatures each gain Temporary Hit Points equal to your character level plus the modifier of the ability score increased by this feat.",
    "abilityScoreIncrease": {
      "options": [
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "keen-mind",
    "name": "Keen Mind",
    "category": "General",
    "level": 4,
    "prerequisites": ["Intelligence 13 or higher"],
    "description": "You have a mind that can track time, direction, and detail with uncanny precision, gaining the following benefits:\n- Ability Score Increase. Increase your Intelligence score by 1, to a maximum of 20.\n- Lore Knowledge. Choose one of the following skills: Arcana, History, Investigation, Nature, or Religion. If you lack proficiency in the chosen skill, you gain proficiency in it, and if you already have proficiency in it, you gain Expertise in it.\n- Quick Study. You can take the Study action as a Bonus Action.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence"
      ],
      "amount": 1
    },
    "choiceConfig": {
      "skill": {
        "type": "skill",
        "label": "Choose a Lore Knowledge skill",
        "options": [
          "Arcana",
          "History",
          "Investigation",
          "Nature",
          "Religion"
        ]
      }
    },
    "source": "2024 PHB"
  },
  {
    "id": "lightly-armored",
    "name": "Lightly Armored",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have trained to master the use of Light Armor, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Armor Training. You gain proficiency with Light Armor and Shields.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "mage-slayer",
    "name": "Mage Slayer",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Concentration Breaker. When you damage a creature that is concentrating on a spell, that creature has Disadvantage on the saving throw it makes to maintain Concentration.\n- Guarded Mind. If you fail an Intelligence, Wisdom, or Charisma saving throw, you can cause yourself to succeed instead. Once you use this benefit, you can't use it again until you finish a Short or Long Rest.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "medium-armor-master",
    "name": "Medium Armor Master",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Medium Armor Training"
    ],
    "description": "You have practiced moving in Medium Armor to gain the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Dexterous Wearer. While you are wearing Medium Armor, you can add 3, rather than 2, to your AC if you have a Dexterity score of 16 or higher.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "moderately-armored",
    "name": "Moderately Armored",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Light Armor Training"
    ],
    "description": "You have trained to master the use of Medium Armor, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Armor Training. You gain training with Medium Armor.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "mounted-combatant",
    "name": "Mounted Combatant",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You are a dangerous foe to face while mounted. You gain the following benefits:\n- Ability Score Increase. Increase your Strength, Dexterity, or Wisdom score by 1, to a maximum of 20.\n- Mounted Strike. While mounted, you have Advantage on melee attack rolls against any unmounted creature that is smaller than your mount.\n- Leap Aside. If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails.\n- Vaulting Saddle. You can force an attack targeted at your mount to target you instead if you aren't Incapacitated.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Wisdom"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "observant",
    "name": "Observant",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Intelligence or Wisdom 13 or higher"
    ],
    "description": "Quick to notice details of your environment, you gain the following benefits:\n- Ability Score Increase. Increase your Intelligence or Wisdom score by 1, to a maximum of 20.\n- Keen Observer. Choose one of the following skills: Insight, Investigation, or Perception. If you lack proficiency in the chosen skill, you gain proficiency in it, and if you already have proficiency in it, you gain Expertise in it.\n- Quick Search. You can take the Search action as a Bonus Action.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom"
      ],
      "amount": 1
    },
    "choiceConfig": {
      "skill": {
        "type": "skill",
        "label": "Choose a Keen Observer skill",
        "options": [
          "Insight",
          "Investigation",
          "Perception"
        ]
      }
    },
    "source": "2024 PHB"
  },
  {
    "id": "piercer",
    "name": "Piercer",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have achieved a penetrating precision in combat, granting you the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Twist the Blade. Once per turn, when you hit a creature with an attack that deals Piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.\n- Enhanced Critical. When you score a Critical Hit that deals Piercing damage to a creature, you can roll one additional damage die when determining the extra Piercing damage the target takes.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "poisoner",
    "name": "Poisoner",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have trained with poisons and can effectively employ them, gaining the following benefits:\n- Ability Score Increase. Increase your Dexterity or Intelligence score by 1, to a maximum of 20.\n- Potent Poison. You gain proficiency with the Poisoner's Kit if you don't already have it. As a Bonus Action, you can apply a poison to a weapon or piece of ammunition. You can prepare a number of doses equal to your Proficiency Bonus with 1 hour of work using a Poisoner's Kit and materials worth 50 GP. Once applied to a weapon or piece of ammunition, the poison retains its potency for 1 minute or until you hit with the weapon or ammunition. When a weapon or piece of ammunition coated in the poison deals damage to a creature, that creature must succeed on a Constitution saving throw (DC = 8 + the modifier of the ability increased by this feat + your Proficiency Bonus) or take 2d8 Poison damage and have the Poisoned condition until the end of your next turn.\n- Bypass Resistance. Poison damage dealt by you ignores Resistance to Poison damage.",
    "abilityScoreIncrease": {
      "options": [
        "Dexterity",
        "Intelligence"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "polearm-master",
    "name": "Polearm Master",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Strength or Dexterity 13 or higher"
    ],
    "description": "You have trained extensively with pole weapons, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Bonus Attack. When you take the Attack action and attack with a Quarterstaff, Spear, Glaive, Halberd, or Pike, you can use a Bonus Action to make a melee attack with the opposite end of the weapon. This attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a d4, and it deals Bludgeoning damage.\n- Reactive Strike. While you are holding a Quarterstaff, Spear, Glaive, Halberd, or Pike, you can use your Reaction to make one melee attack against a creature that enters the reach you have with that weapon.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "resilient",
    "name": "Resilient",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have trained to be more resilient, gaining the following benefits:\n- Ability Score Increase. Choose one ability in which you lack saving throw proficiency. Increase the chosen ability score by 1, to a maximum of 20.\n- Saving Throw Proficiency. You gain proficiency in saving throws using the chosen ability.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "choiceConfig": {
      "ability": {
        "type": "ability",
        "label": "Choose an ability for save proficiency",
        "options": [
          "Strength",
          "Dexterity",
          "Constitution",
          "Intelligence",
          "Wisdom",
          "Charisma"
        ]
      }
    },
    "source": "2024 PHB"
  },
  {
    "id": "ritual-caster",
    "name": "Ritual Caster",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Intelligence, Wisdom, or Charisma 13 or higher"
    ],
    "description": "You have studied ritual magic, gaining the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Ritual Spells. You have learned a number of level 1 spells equal to your Proficiency Bonus that have the Ritual tag from the Cleric, Druid, or Wizard spell list (your choice). You always have those spells prepared, and you can cast them as Rituals. You can also cast them using any spell slots you have. Whenever your Proficiency Bonus increases thereafter, you can add an additional Ritual spell of any level for which you have spell slots.\n- Quick Ritual. You can cast a Ritual spell with its normal casting time rather than adding 10 minutes. Once you cast a spell in this way, you can't use this benefit again until you finish a Long Rest.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "sentinel",
    "name": "Sentinel",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Strength or Dexterity 13 or higher"
    ],
    "description": "You have mastered techniques to take advantage of every drop in any enemy's guard, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Guardian. Immediately after a creature within 5 feet of you takes the Disengage action or hits a target other than you with an attack, you can make an Opportunity Attack against that creature.\n- Halt. When you hit a creature with an Opportunity Attack, the creature's Speed becomes 0 for the rest of the current turn.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "shadow-touched",
    "name": "Shadow-Touched",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "Your exposure to the Shadowfell's magic has changed you, granting you the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Shadow Magic. You learn the Invisibility spell and one level 1 spell of your choice. The level 1 spell must be from the Illusion or Necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either spell in this way, you can't cast that spell in this way again until you finish a Long Rest. You can also cast these spells using spell slots you have of the appropriate level.\n- Spellcasting Ability. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat).",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "sharpshooter",
    "name": "Sharpshooter",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Dexterity 13 or higher"
    ],
    "description": "You can make shots that others find impossible, gaining the following benefits:\n- Ability Score Increase. Increase your Dexterity score by 1, to a maximum of 20.\n- Bypass Cover. Your ranged weapon attack rolls ignore Half Cover and Three-Quarters Cover.\n- Firing in Melee. Being within 5 feet of an enemy doesn't impose Disadvantage on your ranged attack rolls.\n- Long-Range Shooting. Attacking at Long Range doesn't impose Disadvantage on your ranged weapon attack rolls.",
    "abilityScoreIncrease": {
      "options": [
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "shield-master",
    "name": "Shield Master",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Shield Training"
    ],
    "description": "You use shields not just for protection but also for offense, gaining the following benefits while wielding a Shield:\n- Ability Score Increase. Increase your Strength score by 1, to a maximum of 20.\n- Shield Bash. If you attack a creature within 5 feet of you as part of the Attack action and hit with a melee weapon, you can immediately use a Bonus Action to try to shove that creature with your Shield.\n- Interpose Shield. If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your Reaction to take no damage if you succeed on the saving throw, interposing your Shield between yourself and the source of the effect.",
    "abilityScoreIncrease": {
      "options": [
        "Strength"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "skill-expert",
    "name": "Skill Expert",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have honed your proficiency with particular skills, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 20.\n- Skill Proficiency. You gain proficiency in one skill of your choice.\n- Expertise. Choose one skill in which you have proficiency. You gain Expertise in that skill.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "choiceConfig": {
      "skill": {
        "type": "skill",
        "label": "Choose a skill for proficiency",
        "options": [
          "Acrobatics",
          "Animal Handling",
          "Arcana",
          "Athletics",
          "Deception",
          "History",
          "Insight",
          "Intimidation",
          "Investigation",
          "Medicine",
          "Nature",
          "Perception",
          "Performance",
          "Persuasion",
          "Religion",
          "Sleight of Hand",
          "Stealth",
          "Survival"
        ]
      },
      "expertise": {
        "type": "skill",
        "label": "Choose a skill for expertise",
        "options": [
          "Acrobatics",
          "Animal Handling",
          "Arcana",
          "Athletics",
          "Deception",
          "History",
          "Insight",
          "Intimidation",
          "Investigation",
          "Medicine",
          "Nature",
          "Perception",
          "Performance",
          "Persuasion",
          "Religion",
          "Sleight of Hand",
          "Stealth",
          "Survival"
        ]
      }
    },
    "source": "2024 PHB"
  },
  {
    "id": "skulker",
    "name": "Skulker",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Dexterity 13 or higher"
    ],
    "description": "You are expert at slinking through shadows, gaining the following benefits:\n- Ability Score Increase. Increase your Dexterity score by 1, to a maximum of 20.\n- Blindsight. You have Blindsight with a range of 10 feet.\n- Fog of War. You exploit the distractions of battle, gaining Advantage on any Dexterity (Stealth) check you make as part of the Hide action during combat.\n- Sniper. If you make an attack roll while Hidden and the roll misses, making the attack roll doesn't reveal your location.",
    "abilityScoreIncrease": {
      "options": [
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "slasher",
    "name": "Slasher",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You've learned where to cut to have the greatest results, granting you the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Hamstring. Once per turn, when you hit a creature with an attack that deals Slashing damage, you can reduce the Speed of the target by 10 feet until the start of your next turn.\n- Enhanced Critical. When you score a Critical Hit that deals Slashing damage to a creature, the target has Disadvantage on all attack rolls until the start of your next turn.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "speedy",
    "name": "Speedy",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Dexterity or Constitution 13 or higher"
    ],
    "description": "You are exceptionally speedy and agile, gaining the following benefits:\n- Ability Score Increase. Increase your Dexterity or Constitution score by 1, to a maximum of 20.\n- Speed Increase. Your Speed increases by 10 feet.\n- Dash. When you take the Dash action on your turn, Difficult Terrain doesn't cost you extra movement for the rest of that turn.\n- Agile Movement. Opportunity Attacks against you have Disadvantage.",
    "abilityScoreIncrease": {
      "options": [
        "Dexterity",
        "Constitution"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "spell-sniper",
    "name": "Spell Sniper",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Spellcasting or Pact Magic Feature"
    ],
    "description": "You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Bypass Cover. Your spell attack rolls ignore Half Cover and Three-Quarters Cover.\n- Casting in Melee. Being within 5 feet of an enemy doesn't impose Disadvantage on your attack rolls with spells.\n- Increased Range. When you cast a spell that has a range of at least 10 feet, the range of the spell increases by 60 feet.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "telekinetic",
    "name": "Telekinetic",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You learn to move things with your mind, granting you the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Minor Telekinesis. You learn the Mage Hand cantrip. You can cast it without Verbal or Somatic components, and you can make the spectral hand Invisible. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat.\n- Telekinetic Shove. As a Bonus Action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward or away from you.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "telepathic",
    "name": "Telepathic",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You awaken the ability to mentally connect with others, granting you the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Telepathy. You can speak telepathically to any creature you can see within 60 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.\n- Detect Thoughts. You can cast Detect Thoughts, requiring no spell slot or components. Once you cast it in this way, you can't do so again until you finish a Long Rest. You can also cast it using spell slots you have of the appropriate level. Your spellcasting ability for the spell is the ability increased by this feat.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "war-caster",
    "name": "War Caster",
    "category": "General",
    "level": 4,
    "prerequisites": [
      "Spellcasting or Pact Magic feature"
    ],
    "description": "You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- Concentration. You have Advantage on Constitution saving throws that you make to maintain Concentration.\n- Somatic Components. You can perform the Somatic components of spells even when you have weapons or a Shield in one or both hands.\n- Reactive Spell. When a creature provokes an Opportunity Attack from you by moving out of your reach, you can use your Reaction to cast a spell at the creature rather than making an Opportunity Attack. The spell must have a casting time of one action and must target only that creature.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "martial-weapon-training",
    "name": "Martial Weapon Training",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have practiced extensively with a variety of weapons, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Weapon Proficiency. You gain proficiency with Martial weapons.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "weapon-master",
    "name": "Weapon Master",
    "category": "General",
    "level": 4,
    "prerequisites": [],
    "description": "You have practiced extensively with a variety of weapons, gaining the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 20.\n- Mastery Property. Your training with weapons allows you to use the mastery property of one kind of Simple or Martial weapon of your choice. Whenever you finish a Long Rest, you can change the weapon choice.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-archery",
    "name": "Fighting Style: Archery",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "You gain a +2 bonus to attack rolls you make with Ranged weapons.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-blind-fighting",
    "name": "Fighting Style: Blind Fighting",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "You have Blindsight with a range of 10 feet.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-defense",
    "name": "Fighting Style: Defense",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "While you are wearing Light, Medium, or Heavy armor, you gain a +1 bonus to Armor Class.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-dueling",
    "name": "Fighting Style: Dueling",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "When you are wielding a Melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-great-weapon-fighting",
    "name": "Fighting Style: Great Weapon Fighting",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "When you roll damage for an attack you make with a Melee weapon that you are holding with two hands, you can treat any 1 or 2 on a damage die as a 3. The weapon must have the Two-Handed or Versatile property to gain this benefit.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-interception",
    "name": "Fighting Style: Interception",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "When a creature you can see hits a target that is within 5 feet of you with an attack, you can use your Reaction to reduce the damage the target takes by 1d10 + your Proficiency Bonus. You must be wielding a Shield or a Simple or Martial weapon to use this Reaction.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-protection",
    "name": "Fighting Style: Protection",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your Reaction to interpose your Shield and impose Disadvantage on all attack rolls the attacker makes against targets other than you until the start of your next turn, provided you remain within 5 feet of the attacker.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-thrown-weapon-fighting",
    "name": "Fighting Style: Thrown Weapon Fighting",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "You can draw a weapon that has the Thrown property as part of the attack you make with the weapon. In addition, when you hit with a ranged attack using a Thrown weapon, you gain a +2 bonus to the damage roll.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-two-weapon-fighting",
    "name": "Fighting Style: Two-Weapon Fighting",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "When you make an extra attack as a result of using a weapon that has the Light property, you can add your Ability Modifier to the damage of that attack if you aren't already adding it to the damage.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "fighting-style-unarmed-fighting",
    "name": "Fighting Style: Unarmed Fighting",
    "category": "Fighting Style",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "description": "When you hit with your Unarmed Strike and deal damage, you can deal Bludgeoning damage equal to 1d6 + your Strength modifier instead of the normal damage of an Unarmed Strike. If you aren't wielding any weapons or a Shield when you make the attack roll, the d6 becomes a d8. At the start of each of your turns, you can deal 1d4 Bludgeoning damage to one creature Grappled by you.",
    "abilityScoreIncrease": null,
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-combat-prowess",
    "name": "Boon of Combat Prowess",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "You have honed your combat ability to extraordinary levels, gaining the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Peerless Aim. If you miss with an attack roll, you can hit instead. Once you use this benefit, you can't use it again until the start of your next turn.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-dimensional-travel",
    "name": "Boon of Dimensional Travel",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "You can step between the planes in the blink of an eye, gaining the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Blink Steps. Immediately after you take the Attack action or the Magic action, you can teleport up to 30 feet to an unoccupied space you can see. You can use this benefit a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-energy-resistance",
    "name": "Boon of Energy Resistance",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Your exposure to the elements has granted you extraordinary resilience, gaining the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Energy Resistance. You gain Resistance to two of the following damage types of your choice: Acid, Cold, Fire, Lightning, Necrotic, Poison, Psychic, Radiant, or Thunder. Whenever you finish a Long Rest, you can change your choices.\n- Energy Redirection. When you take damage of one of the types chosen for the Energy Resistance benefit, you can use your Reaction to direct energy toward another creature you can see within 60 feet of you. That creature must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your Proficiency Bonus). On a failed save, the creature takes 2d12 + your Constitution modifier damage of the triggering type. On a successful save, the creature takes half as much damage.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-fate",
    "name": "Boon of Fate",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Fate bends in your favor, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Improve or Reduce. When you or another creature within 60 feet of you succeeds on or fails a D20 Test, you can roll 2d4 and apply the number rolled as a bonus or penalty to the d20 roll. Once you use this benefit, you can't use it again until you roll Initiative or finish a Short or Long Rest.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-fortitude",
    "name": "Boon of Fortitude",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Your body has been fortified to a supernatural degree, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Fortified Health. Your Hit Point maximum increases by 40. In addition, whenever you regain Hit Points, you can regain additional Hit Points equal to your Constitution modifier. Once you have regained these additional Hit Points, you can't do so again until the start of your next turn.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-irresistible-offense",
    "name": "Boon of Irresistible Offense",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Your attacks hit with extraordinary force, granting you the following benefits:\n- Ability Score Increase. Increase your Strength or Dexterity score by 1, to a maximum of 30.\n- Overcome Defenses. The Bludgeoning, Piercing, and Slashing damage you deal always ignores Resistance.\n- Overwhelming Strike. When you roll a 20 on the d20 for an attack roll, you can deal extra damage to the target equal to the ability score increased by this feat. The extra damage's type is the same as the attack's type.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-recovery",
    "name": "Boon of Recovery",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Your vitality has reached an extraordinary level, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Last Stand. When you would be reduced to 0 Hit Points, you can regain a number of Hit Points equal to half your Hit Point maximum. Once you use this benefit, you can't use it again until you finish a Long Rest.\n- Recover Vitality. You have a pool of ten d10s. As a Bonus Action, you can expend dice from this pool to regain Hit Points. You roll the dice you expend, and you regain a number of Hit Points equal to the total rolled. You regain all expended dice when you finish a Long Rest.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-skill",
    "name": "Boon of Skill",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Your skills have reached an extraordinary level, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Peerless Skill. You gain proficiency in all skills.\n- Skill Expertise. Choose one skill in which you lack Expertise. You gain Expertise in that skill.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-speed",
    "name": "Boon of Speed",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Your speed has reached an extraordinary level, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Quickened. Your Speed increases by 30 feet.\n- Escape Artist. As a Bonus Action, you can take the Disengage action and end the Grappled condition on yourself.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-spell-recall",
    "name": "Boon of Spell Recall",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [
      "Spellcasting Feature"
    ],
    "description": "Your connection to magic has been fortified, granting you the following benefits:\n- Ability Score Increase. Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 30.\n- Free Casting. Whenever you cast a spell with a spell slot of level 1 through 4, roll 1d4. If the number you roll is the same as the slot's level, the slot isn't expended.",
    "abilityScoreIncrease": {
      "options": [
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-the-night-spirit",
    "name": "Boon of the Night Spirit",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "The shadows have embraced you, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Merge with Shadows. While within Dim Light or Darkness, you can give yourself the Invisible condition as a Bonus Action. The condition ends on you immediately after you take an action, a Bonus Action, or a Reaction.\n- Shadowy Form. While within Dim Light or Darkness, you have Resistance to all damage except Psychic and Radiant.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  },
  {
    "id": "boon-of-truesight",
    "name": "Boon of Truesight",
    "category": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "description": "Your vision has been enhanced to a supernatural degree, granting you the following benefits:\n- Ability Score Increase. Increase one ability score of your choice by 1, to a maximum of 30.\n- Truesight. You have Truesight with a range of 60 feet.",
    "abilityScoreIncrease": {
      "options": [
        "Strength",
        "Dexterity",
        "Constitution",
        "Intelligence",
        "Wisdom",
        "Charisma"
      ],
      "amount": 1
    },
    "source": "2024 PHB"
  }
]
