{
  "creatorOrIntendedUser": {
    "die": "d20",
    "entries": [
      { "roll": "1", "name": "Aberration", "description": "The item is ancient. At a glance, it seems to be covered with mucus." },
      { "roll": "2", "name": "Celestial", "description": "The item is half the normal weight and inscribed with feathered wings, suns, and stars. Fiends find it repulsive." },
      { "roll": "3", "name": "Devotees of Lolth", "description": "The item is half the normal weight. It is inscribed with spiders and webs in honor of Lolth." },
      { "roll": "4", "name": "Dragon", "description": "This item incorporates precious metals and gems from a dragon's hoard. It grows warm when within 120 feet of a Dragon." },
      { "roll": "5-6", "name": "Dwarf", "description": "The item is durable and has Dwarvish runes worked into its design. It might be associated with a clan that would like to see it returned to their ancestral halls." },
      { "roll": "7", "name": "Elemental Air", "description": "The item is half the normal weight and feels hollow. If it's made of fabric, it is diaphanous." },
      { "roll": "8", "name": "Elemental Earth", "description": "This item might be crafted from stone. Any cloth or leather elements are studded with finely polished rock." },
      { "roll": "9", "name": "Elemental Fire", "description": "This item is warm to the touch, and any metal parts are crafted from black iron. Flame imagery covers its surface." },
      { "roll": "10", "name": "Elemental Water", "description": "Lustrous fish scales replace leather or cloth on this item, and seashells and worked coral (as hard as any metal) replace metal portions." },
      { "roll": "11-12", "name": "Elf", "description": "The item is half the normal weight. It is adorned with symbols of nature: leaves, vines, stars, and the like." },
      { "roll": "13", "name": "Fey", "description": "The item is exquisitely crafted from the finest materials and glows with a pale radiance in moonlight, shedding Dim Light in a 5-foot radius. Any metal in the item is silver or mithral rather than iron or steel." },
      { "roll": "14", "name": "Fiend", "description": "The item is made of iron or horn, and any cloth or leather components are crafted from the hide of Fiends. Leering faces or vile runes are engraved on its surface. Celestials find it repulsive." },
      { "roll": "15", "name": "Giant", "description": "The item is larger than normal and was crafted by Giants for use by their smaller allies." },
      { "roll": "16", "name": "Gnome", "description": "The item is crafted to appear ordinary and well used. It could also incorporate gears and mechanical components, even if these aren't essential to its function." },
      { "roll": "17-19", "name": "Human", "description": "The item was created during the heyday of a fallen human kingdom, or it is tied to a human of legend. It might hold writing in a forgotten language or symbols whose significance is lost to the ages." },
      { "roll": "20", "name": "Undead", "description": "The item incorporates symbols of death, such as bones and skulls, and it might be crafted from parts of corpses. It feels cold to the touch." }
    ]
  },
  "history": {
    "die": "d8",
    "entries": [
      { "roll": "1", "name": "Arcane", "description": "This item was created for an ancient order of spellcasters and bears the order's symbol." },
      { "roll": "2", "name": "Bane", "description": "This item was created to oppose creatures of a particular type, such as Aberrations or Dragons." },
      { "roll": "3", "name": "Heroic", "description": "A great hero once wielded this item. Anyone who knows this item's history expects great deeds from the new owner." },
      { "roll": "4", "name": "Ornament", "description": "The item honors a special event. Inset gemstones, gold or platinum inlays, and gold or silver filigree adorn its surface." },
      { "roll": "5", "name": "Prophecy", "description": "The item features in a prophecy: its bearer is destined to play a key role in future events." },
      { "roll": "6", "name": "Religious", "description": "This item was used in religious ceremonies dedicated to a particular deity. It has religious symbols worked into it." },
      { "roll": "7", "name": "Sinister", "description": "This item is linked to a deed of great evil, such as a massacre or an assassination. It might have a name or be closely associated with a villain who used it." },
      { "roll": "8", "name": "Symbol of Power", "description": "This item was once used as part of royal regalia or as a badge of high office." }
    ]
  },
  "minorProperty": {
    "die": "d20",
    "entries": [
      { "roll": "1-2", "name": "Beacon", "description": "You can take a Bonus Action to cause the item to shed Bright Light in a 10-foot radius and Dim Light for an additional 10 feet, or to extinguish the light." },
      { "roll": "3", "name": "Compass", "description": "You can take a Magic action to learn which way is magnetic north. Nothing happens if this property is used in a location that has no magnetic north." },
      { "roll": "4", "name": "Delver", "description": "While underground, you always know the item's depth below the surface and the direction to the nearest staircase, ramp, or other path leading upward." },
      { "roll": "5-6", "name": "Guardian", "description": "The item warns you, granting +2 bonus to your Initiative rolls if you don't have the Incapacitated condition." },
      { "roll": "7-8", "name": "Harmonious", "description": "Attuning to this item takes only 1 minute." },
      { "roll": "9", "name": "Key", "description": "The item is used to unlock a container, chamber, vault, or door." },
      { "roll": "10", "name": "Secret Message", "description": "A message is hidden somewhere on the item. It might be visible only at a certain time, under the light of one phase of the moon, or in a specific location." },
      { "roll": "11-12", "name": "Sentinel", "description": "The DM chooses a kind of creature, such as mind flayers or trolls. This item glows faintly when such creatures are within 120 feet of it." },
      { "roll": "13", "name": "Songcraft", "description": "Whenever this item is struck or is used to strike a foe, you hear a fragment of an ancient song." },
      { "roll": "14-15", "name": "Strange Material", "description": "The item was created from a material that is bizarre given its purpose. Its durability is unaffected." },
      { "roll": "16", "name": "Temperate", "description": "You are unharmed by temperatures of 0 degrees Fahrenheit or lower, and 100 degrees Fahrenheit or higher." },
      { "roll": "17", "name": "Unbreakable", "description": "The item can't be broken. Special means must be used to destroy it." },
      { "roll": "18", "name": "War Leader", "description": "You can take a Magic action to cause your voice or signal to carry clearly for up to 600 feet until the end of your next turn." },
      { "roll": "19", "name": "Waterborne", "description": "This item floats on water and other liquids. You have Advantage on Strength (Athletics) checks to swim." },
      { "roll": "20", "name": "Roll Twice", "description": "Roll twice, rerolling any additional 20s." }
    ]
  },
  "quirk": {
    "die": "d8",
    "entries": [
      { "roll": "1", "name": "Blissful", "description": "You feel fortunate and optimistic about what the future holds. Butterflies and other harmless creatures might frolic in the item's presence." },
      { "roll": "2", "name": "Confident", "description": "The item helps you feel self-assured." },
      { "roll": "3", "name": "Covetous", "description": "You become obsessed with material wealth." },
      { "roll": "4", "name": "Fragile", "description": "The item crumbles, frays, chips, or cracks slightly when wielded, worn, or activated. This quirk has no effect on its properties." },
      { "roll": "5", "name": "Loud", "description": "The item makes a loud noise — such as a clang, a shout, or a resonating gong — when used." },
      { "roll": "6", "name": "Metamorphic", "description": "The item periodically alters its appearance in slight ways. You have no control over these minor alterations, which have no effect on the item's use." },
      { "roll": "7", "name": "Painful", "description": "You experience a harmless flash of pain when using the item." },
      { "roll": "8", "name": "Repulsive", "description": "You feel a sense of distaste when in contact with the item and continue to experience discomfort while bearing it." }
    ]
  },
  "potionMiscibility": {
    "die": "d100",
    "entries": [
      { "roll": "01", "result": "Both potions lose their effects, and the mixture creates a magical explosion in a 5-foot-radius Sphere centered on itself. Each creature in that area takes 4d10 Force damage." },
      { "roll": "02-08", "result": "Both potions lose their effects, and the mixture becomes an ingested poison of the DM's choice." },
      { "roll": "09-15", "result": "Both potions lose their effects." },
      { "roll": "16-25", "result": "One potion loses its effect." },
      { "roll": "26-35", "result": "Both potions work, but with their numerical effects and durations halved. If a potion has no numerical effect and no duration, it instead loses its effect." },
      { "roll": "36-90", "result": "Both potions work normally." },
      { "roll": "91-99", "result": "Both potions work, but the numerical effects and duration of one potion are doubled. If neither potion has anything to double in this way, they work normally." },
      { "roll": "00", "result": "Only one potion works, but its effects are permanent. Choose the simplest effect to make permanent or the one that seems the most fun. A Dispel Magic spell or similar magic might end this lasting effect." }
    ]
  },
  "artifactProperties": {
    "minorBeneficial": {
      "die": "d100",
      "entries": [
        { "roll": "01-20", "description": "While attuned to the Artifact, you gain proficiency in one skill of the DM's choice." },
        { "roll": "21-30", "description": "While attuned to the Artifact, you have Immunity to the Poisoned condition." },
        { "roll": "31-40", "description": "While attuned to the Artifact, you have Immunity to the Charmed and Frightened conditions." },
        { "roll": "41-50", "description": "While attuned to the Artifact, you have Resistance to one damage type of the DM's choice." },
        { "roll": "51-60", "description": "While attuned to the Artifact, you can cast one cantrip (chosen by the DM) from it." },
        { "roll": "61-70", "description": "While attuned to the Artifact, you can cast one level 1 spell (chosen by the DM) from it. After you cast the spell, roll 1d6. On a roll of 1-5, you can't cast it again in this way until the next dawn." },
        { "roll": "71-80", "description": "As 61-70 above, except the spell is level 2." },
        { "roll": "81-90", "description": "As 61-70 above, except the spell is level 3." },
        { "roll": "91-00", "description": "While attuned to the Artifact, you gain a +1 bonus to Armor Class." }
      ]
    },
    "majorBeneficial": {
      "die": "d100",
      "entries": [
        { "roll": "01-20", "description": "While attuned to the Artifact, one of your ability scores (DM's choice) increases by 2, to a maximum of 24." },
        { "roll": "21-30", "description": "While attuned to the Artifact, you regain 1d6 Hit Points at the start of each of your turns if you have at least 1 Hit Point." },
        { "roll": "31-40", "description": "When you hit with an attack roll while attuned to the Artifact, the target takes an extra 1d6 Force damage." },
        { "roll": "41-50", "description": "While you're attuned to the Artifact, your Speed increases by 10 feet." },
        { "roll": "51-60", "description": "While attuned to the Artifact, you can cast one level 4 spell (chosen by the DM) from it. After you cast the spell, roll 1d6. On a roll of 1-5, you can't cast it again in this way until the next dawn." },
        { "roll": "61-70", "description": "As 51-60 above, except the spell is level 5." },
        { "roll": "71-80", "description": "As 51-60 above, except the spell is level 6." },
        { "roll": "81-90", "description": "As 51-60 above, except the spell is level 7." },
        { "roll": "91-00", "description": "While attuned to the Artifact, you have Immunity to the Blinded, Deafened, Petrified, and Stunned conditions." }
      ]
    },
    "minorDetrimental": {
      "die": "d100",
      "entries": [
        { "roll": "01-08", "description": "While attuned to the Artifact, you have Disadvantage on any ability check or saving throw that uses Strength or Constitution." },
        { "roll": "09-16", "description": "While attuned to the Artifact, you have Disadvantage on Intelligence, Wisdom, and Charisma saving throws." },
        { "roll": "17-24", "description": "While attuned to the Artifact, you have Vulnerability to Poison damage." },
        { "roll": "25-32", "description": "While attuned to the Artifact, you have the Blinded condition when you're more than 10 feet away from it." },
        { "roll": "33-40", "description": "While attuned to the Artifact, you have the Deafened condition when you're more than 10 feet away from it." },
        { "roll": "41-48", "description": "While attuned to the Artifact, you lose all sense of smell." },
        { "roll": "49-66", "description": "While you're attuned to the Artifact, your appearance changes as the DM decides." },
        { "roll": "67-72", "description": "While attuned to the Artifact, you emit a sour stench noticeable from up to 10 feet away." },
        { "roll": "73-76", "description": "Whenever you touch a nonmagical gem or an art object while attuned to this Artifact, the value of the gem or art object is reduced by half. This affects a particular object only once." },
        { "roll": "77-80", "description": "While you're attuned to the Artifact, all Holy Water within 10 feet of you is destroyed." },
        { "roll": "81-84", "description": "While you're attuned to the Artifact, nonmagical flames are extinguished within 30 feet of you." },
        { "roll": "85-88", "description": "While you're attuned to the Artifact, other creatures can't take Short or Long Rests while within 300 feet of you." },
        { "roll": "89-92", "description": "While attuned to the Artifact, you kill any nonmagical vegetation you touch that isn't a creature." },
        { "roll": "93-00", "description": "While attuned to the Artifact, Beasts within 30 feet of you that have a Challenge Rating of 6 or lower are Hostile toward you." }
      ]
    },
    "majorDetrimental": {
      "die": "d100",
      "entries": [
        { "roll": "01-09", "description": "You can't attune to other magic items while you're attuned to the Artifact. When you become attuned to the Artifact, your Attunement to other magic items ends immediately." },
        { "roll": "10-18", "description": "When you become attuned to the Artifact, a random one of your ability scores is reduced by 2, to a minimum of 3. A Greater Restoration spell restores the ability." },
        { "roll": "19-27", "description": "When you become attuned to the Artifact, you take 8d10 Psychic damage." },
        { "roll": "28-36", "description": "The first time you become attuned to the Artifact, it gives you a quest determined by the DM. You can't use any of the Artifact's properties until you complete the quest." },
        { "roll": "37-45", "description": "Each time you become attuned to the Artifact, there is a 10 percent chance that you attract the attention of a god who sends an avatar to wrest the Artifact from you." },
        { "roll": "46-54", "description": "Each time you become attuned to the Artifact, you must succeed on a DC 10 Constitution saving throw or die from the shock. If you die, you're instantly transformed into a Wight under the DM's control that must protect the Artifact." },
        { "roll": "55-63", "description": "The Artifact dilutes potions within 10 feet of itself, rendering them nonmagical." },
        { "roll": "64-72", "description": "The Artifact erases scrolls within 10 feet of itself, rendering them nonmagical." },
        { "roll": "73-81", "description": "While you're attuned to the Artifact, creatures of a particular type other than Humanoid (chosen by the DM) are always Hostile toward you." },
        { "roll": "82-90", "description": "While attuned to the Artifact, you have Vulnerability to all damage." },
        { "roll": "91-96", "description": "The Artifact imprisons a Death Slaad. Each time you become attuned to the Artifact, the slaad has a 10 percent chance of escaping, whereupon it appears and attacks you." },
        { "roll": "97-00", "description": "While attuned to the Artifact, you can't spend Hit Point Dice or regain Hit Points." }
      ]
    }
  },
  "sentientItem": {
    "alignment": {
      "die": "d100",
      "entries": [
        { "roll": "01-15", "alignment": "Lawful Good" },
        { "roll": "16-35", "alignment": "Neutral Good" },
        { "roll": "36-50", "alignment": "Chaotic Good" },
        { "roll": "51-63", "alignment": "Lawful Neutral" },
        { "roll": "64-73", "alignment": "Neutral" },
        { "roll": "74-85", "alignment": "Chaotic Neutral" },
        { "roll": "86-89", "alignment": "Lawful Evil" },
        { "roll": "90-96", "alignment": "Neutral Evil" },
        { "roll": "97-00", "alignment": "Chaotic Evil" }
      ]
    },
    "communication": {
      "die": "d10",
      "entries": [
        { "roll": "1-6", "method": "The item communicates by transmitting emotion to the creature carrying or wielding it." },
        { "roll": "7-9", "method": "The item speaks one or more languages." },
        { "roll": "10", "method": "The item speaks one or more languages. In addition, the item can communicate telepathically with any creature that carries or wields it." }
      ]
    },
    "senses": {
      "die": "d4",
      "entries": [
        { "roll": "1", "senses": "Hearing and standard vision out to 30 feet" },
        { "roll": "2", "senses": "Hearing and standard vision out to 60 feet" },
        { "roll": "3", "senses": "Hearing and standard vision out to 120 feet" },
        { "roll": "4", "senses": "Hearing and Darkvision out to 120 feet" }
      ]
    },
    "specialPurpose": {
      "die": "d10",
      "entries": [
        { "roll": "1", "name": "Aligned", "description": "The item seeks to defeat or destroy those of a diametrically opposed alignment. Such an item is never Neutral." },
        { "roll": "2", "name": "Bane", "description": "The item seeks to thwart or destroy creatures of a particular type, such as Constructs, Fiends, or Undead." },
        { "roll": "3", "name": "Creator Seeker", "description": "The item seeks its creator and wants to understand why it was created." },
        { "roll": "4", "name": "Destiny Seeker", "description": "The item believes it and its bearer have key roles to play in future events." },
        { "roll": "5", "name": "Destroyer", "description": "The item craves destruction and goads its user to fight arbitrarily." },
        { "roll": "6", "name": "Glory Seeker", "description": "The item seeks renown as the greatest magic item in the world by winning fame or notoriety for its user." },
        { "roll": "7", "name": "Lore Seeker", "description": "The item craves knowledge or is determined to solve a mystery, learn a secret, or unravel a cryptic prophecy." },
        { "roll": "8", "name": "Protector", "description": "The item seeks to defend a particular kind of creature, such as elves or werewolves." },
        { "roll": "9", "name": "Soulmate Seeker", "description": "The item seeks another sentient magic item, perhaps one that is similar to itself." },
        { "roll": "10", "name": "Templar", "description": "The item seeks to defend the servants and interests of a particular deity." }
      ]
    },
    "conflict": {
      "description": "When the bearer acts against the item's alignment or purpose, the bearer makes a Charisma saving throw (DC 12 + item's Charisma modifier). On failure, the item can demand: Chase My Dreams (pursue item's goals exclusively), Seek Atonement (change behavior), Reject All Others (give up other magic items). If demands aren't met, the item can: suppress its activated properties, attempt to control the bearer (contested Charisma check), or make attunement impossible until bearer acts in accordance with the item's wishes."
    }
  },
  "magicItemResilience": "Most magic items, other than Potions and Scrolls, have Resistance to all damage. An Artifact can be destroyed only in some special way; otherwise it is impervious to damage."
}
