[
  {
    "id": "ballista",
    "name": "Ballista",
    "ac": 15,
    "hp": 50,
    "size": "Large",
    "damage": "3d10",
    "damageType": "Piercing",
    "rangeNormal": 120,
    "rangeLong": 480,
    "crew": 3,
    "cost": "500 gp",
    "description": "A massive crossbow that fires heavy bolts. Before it can be fired, it must be loaded and aimed. It takes one action to load the weapon, one action to aim it, and one action to fire it."
  },
  {
    "id": "cannon",
    "name": "Cannon",
    "ac": 19,
    "hp": 75,
    "size": "Large",
    "damage": "8d10",
    "damageType": "Bludgeoning",
    "rangeNormal": 600,
    "rangeLong": 2400,
    "crew": 3,
    "cost": "1,500 gp",
    "description": "A cannon uses gunpowder to propel heavy balls of cast iron through the air at devastating speeds. Before it can be fired, the cannon must be loaded and aimed. It takes one action to load the weapon, one action to aim it, and one action to fire it."
  },
  {
    "id": "cauldron-boiling-oil",
    "name": "Cauldron of Boiling Oil",
    "ac": 19,
    "hp": 10,
    "size": "Small",
    "damage": "3d6",
    "damageType": "Fire",
    "rangeNormal": null,
    "rangeLong": null,
    "crew": 1,
    "cost": "100 gp",
    "description": "A cauldron of boiling oil is typically positioned above a castle gate or atop a defensive wall. Its contents are poured onto attackers below. The cauldron can be tipped as an action, pouring the boiling oil onto a 10-foot-square area directly below."
  },
  {
    "id": "ram",
    "name": "Battering Ram",
    "ac": 15,
    "hp": 100,
    "size": "Large",
    "damage": "3d10",
    "damageType": "Bludgeoning",
    "rangeNormal": null,
    "rangeLong": null,
    "crew": 4,
    "cost": "400 gp",
    "description": "A ram consists of a movable gallery fitted with a heavy log suspended from two overhead beams by chains. The log is swung to strike a target. It takes a minimum number of crew members to swing the ram."
  },
  {
    "id": "siege-tower",
    "name": "Siege Tower",
    "ac": 15,
    "hp": 200,
    "size": "Gargantuan",
    "damage": null,
    "damageType": null,
    "rangeNormal": null,
    "rangeLong": null,
    "crew": null,
    "cost": "2,000 gp",
    "description": "A siege tower is a mobile wooden structure with a platform on top that can be raised to the height of a castle wall. The tower is wheeled up to a wall, and troops ascend internal ladders to reach the platform and assault the wall. The tower provides Total Cover to creatures inside it."
  },
  {
    "id": "trebuchet",
    "name": "Trebuchet",
    "ac": 15,
    "hp": 150,
    "size": "Huge",
    "damage": "8d10",
    "damageType": "Bludgeoning",
    "rangeNormal": 300,
    "rangeLong": 1200,
    "crew": 5,
    "cost": "3,000 gp",
    "description": "A trebuchet is a siege engine that uses a counterweight to hurl stones or other heavy projectiles at structures and enemies from a great distance. Before it can be fired, it must be loaded and aimed. It takes two actions to load the weapon, two actions to aim it, and one action to fire it."
  }
]
