[
  {
    "id": "toughness",
    "name": "Toughness",
    "level": 1,
    "traits": ["general"],
    "description": "You can withstand more punishment than most before succumbing. Increase your maximum Hit Points by your level. The DC of recovery checks is equal to 9 + your dying condition value.",
    "prerequisites": ""
  },
  {
    "id": "fleet",
    "name": "Fleet",
    "level": 1,
    "traits": ["general"],
    "description": "You move more quickly on foot. Your Speed increases by 5 feet.",
    "prerequisites": ""
  },
  {
    "id": "incredible-initiative",
    "name": "Incredible Initiative",
    "level": 1,
    "traits": ["general"],
    "description": "You react more quickly than others. You gain a +2 circumstance bonus to initiative rolls.",
    "prerequisites": ""
  },
  {
    "id": "shield-block",
    "name": "Shield Block",
    "level": 1,
    "traits": ["general"],
    "description": "You snap your shield in place to ward off a blow. Your shield prevents you from taking an amount of damage up to the shield's Hardness. You and the shield each take any remaining damage, possibly breaking or destroying the shield.",
    "prerequisites": ""
  },
  {
    "id": "armor-proficiency",
    "name": "Armor Proficiency",
    "level": 1,
    "traits": ["general"],
    "description": "You become trained in light armor. If you already were trained in light armor, you gain training in medium armor. If you were trained in both, you become trained in heavy armor.",
    "prerequisites": ""
  },
  {
    "id": "weapon-proficiency",
    "name": "Weapon Proficiency",
    "level": 1,
    "traits": ["general"],
    "description": "You become trained in all simple weapons. If you were already trained in all simple weapons, you become trained in all martial weapons. If you were already trained in all martial weapons, you become trained in one advanced weapon of your choice.",
    "prerequisites": ""
  },
  {
    "id": "diehard",
    "name": "Diehard",
    "level": 1,
    "traits": ["general"],
    "description": "It takes more to kill you than most. You die from the dying condition at dying 5, rather than dying 4.",
    "prerequisites": ""
  },
  {
    "id": "fast-recovery",
    "name": "Fast Recovery",
    "level": 1,
    "traits": ["general"],
    "description": "Your body quickly recovers from afflictions. You regain twice as many Hit Points from resting. Each time you succeed at a Fortitude save against an ongoing disease or poison, you reduce its stage by 2, or by 1 against a virulent disease or poison. Each critical success you achieve against an ongoing disease or poison reduces its stage by 3, or by 2 against a virulent disease or poison.",
    "prerequisites": "Constitution 14"
  },
  {
    "id": "feather-step",
    "name": "Feather Step",
    "level": 1,
    "traits": ["general"],
    "description": "You step carefully and quickly. You can Step into difficult terrain.",
    "prerequisites": "Dexterity 14"
  },
  {
    "id": "ride",
    "name": "Ride",
    "level": 1,
    "traits": ["general"],
    "description": "When you command your mount to move, you automatically succeed at the check to Command an Animal. You don't need to attempt a check to remain mounted in normal circumstances, though you still need to attempt checks when the situation is more challenging (such as when your mount is Panicked).",
    "prerequisites": ""
  },
  {
    "id": "adopted-ancestry",
    "name": "Adopted Ancestry",
    "level": 1,
    "traits": ["general"],
    "description": "You were raised by a family of a different ancestry than your own, and you have access to that ancestry's ancestry feats. Choose an ancestry. You can select ancestry feats from the ancestry you chose, in addition to your own ancestry's feats.",
    "prerequisites": ""
  },
  {
    "id": "breath-control",
    "name": "Breath Control",
    "level": 1,
    "traits": ["general"],
    "description": "You have incredible breath control, which grants you advantages when living without air. You can hold your breath for 25 times as long as usual before suffocating. You gain a +1 circumstance bonus to saving throws against inhaled threats, such as inhaled poisons, and if you roll a success on such a saving throw, you get a critical success instead.",
    "prerequisites": ""
  },
  {
    "id": "recognize-spell",
    "name": "Recognize Spell",
    "level": 1,
    "traits": ["general", "secret"],
    "description": "If you are trained in the appropriate skill for the spell's tradition and it's a common spell of 2nd level or lower, you automatically recognize it (you still roll to attempt to get a critical success, but you can't get a worse result than success). The highest-level spell you automatically recognize increases to 4th if you're an expert, 6th if you're a master, and 10th if you're legendary.",
    "prerequisites": "Trained in Arcana, Nature, Occultism, or Religion"
  },
  {
    "id": "quick-repair",
    "name": "Quick Repair",
    "level": 1,
    "traits": ["general"],
    "description": "You take 1 minute to Repair an item instead of taking 10 minutes. If you're a master in Crafting, it takes 3 actions. If you're legendary, it takes 1 action.",
    "prerequisites": "Trained in Crafting"
  },
  {
    "id": "thorough-search",
    "name": "Thorough Search",
    "level": 1,
    "traits": ["general"],
    "description": "You take your time to thoroughly search an area. When you Search, you can take twice as long to search an area to gain a +2 circumstance bonus to the Perception check. Any traps or hazards found this way also grant you a +2 circumstance bonus to your initiative roll if combat breaks out.",
    "prerequisites": ""
  },
  {
    "id": "keen-follower",
    "name": "Keen Follower",
    "level": 1,
    "traits": ["general"],
    "description": "You can follow a skilled tracker at full speed. When Tracking, you can move at full Speed while following the tracks of a creature tracked by an ally who has a higher proficiency rank in Survival than you.",
    "prerequisites": ""
  },
  {
    "id": "additional-lore",
    "name": "Additional Lore",
    "level": 1,
    "traits": ["general"],
    "description": "Your knowledge has expanded to encompass a new field. Choose an additional Lore skill subcategory. You become trained in it. At 3rd, 7th, and 15th levels, you gain an additional skill increase you can apply only to the chosen Lore subcategory.",
    "prerequisites": ""
  },
  {
    "id": "combat-climber",
    "name": "Combat Climber",
    "level": 1,
    "traits": ["general"],
    "description": "Your training has taught you to climb in combat conditions. You're not flat-footed while Climbing, and you can Climb with a hand occupied by a weapon or shield. You must still use another hand and both legs to Climb.",
    "prerequisites": "Trained in Athletics"
  },
  {
    "id": "prescient-planner",
    "name": "Prescient Planner",
    "level": 1,
    "traits": ["general"],
    "description": "You regularly account for the unexpected. You can spend 1 minute to retrieve an item you previously purchased but didn't record as having on your person. The item must be common, must cost no more than 1 gp, and must be a piece of adventuring gear.",
    "prerequisites": ""
  },
  {
    "id": "ancestral-paragon",
    "name": "Ancestral Paragon",
    "level": 3,
    "traits": ["general"],
    "description": "Whether through instinct, study, or magic, you feel a deeper connection to your ancestry. You gain a 1st-level ancestry feat.",
    "prerequisites": ""
  },
  {
    "id": "untrained-improvisation",
    "name": "Untrained Improvisation",
    "level": 3,
    "traits": ["general"],
    "description": "You've learned how to handle situations requiring skills you haven't formally trained in. Your proficiency bonus to untrained skill checks is equal to half your level instead of +0. If you're level 7 or higher, the bonus equals your full level instead.",
    "prerequisites": ""
  },
  {
    "id": "canny-acumen",
    "name": "Canny Acumen",
    "level": 3,
    "traits": ["general"],
    "description": "Your avoidance or observation is beyond the pale. Choose Fortitude saves, Reflex saves, Will saves, or Perception. You become an expert in your choice. At 17th level, you become a master in your choice.",
    "prerequisites": ""
  },
  {
    "id": "skill-training",
    "name": "Skill Training",
    "level": 1,
    "traits": ["general"],
    "description": "You become trained in the skill of your choice.",
    "prerequisites": "Intelligence 12"
  },
  {
    "id": "intimidating-prowess-general",
    "name": "Intimidating Prowess",
    "level": 3,
    "traits": ["general"],
    "description": "In situations where you can physically menace the target when you Demoralize, you gain a +1 circumstance bonus to your Intimidation check and a +2 circumstance bonus if you're a master. If the creature is a lower Strength modifier than you, you gain the bonus regardless.",
    "prerequisites": "Strength 16, Expert in Intimidation"
  },
  {
    "id": "expeditious-search",
    "name": "Expeditious Search",
    "level": 7,
    "traits": ["general"],
    "description": "You have a system that lets you search at great speed. You can Search at half the normal speed. If you're a master in Perception, you can Search at full Speed instead.",
    "prerequisites": ""
  },
  {
    "id": "battle-cry",
    "name": "Battle Cry",
    "level": 7,
    "traits": ["general"],
    "description": "When you roll initiative, you can yell a mighty battle cry and attempt to Demoralize an observed foe as a free action. If you're legendary in Intimidation, you can use a reaction to Demoralize your foe when you critically succeed at an attack roll.",
    "prerequisites": "Master in Intimidation"
  },
  {
    "id": "legendary-negotiation",
    "name": "Legendary Negotiation",
    "level": 7,
    "traits": ["general"],
    "description": "You can negotiate incredibly quickly in dire situations. You attempt to Make an Impression and then Request a cease-fire or similar agreement as a single 3-action activity. If you fail the Make an Impression, you still attempt the Request.",
    "prerequisites": "Master in Diplomacy"
  },
  {
    "id": "incredible-investiture",
    "name": "Incredible Investiture",
    "level": 11,
    "traits": ["general"],
    "description": "You have an incredible ability to invest more magic items. Increase your limit on invested magic items from 10 to 12.",
    "prerequisites": "Charisma 16"
  },
  {
    "id": "true-perception",
    "name": "True Perception",
    "level": 11,
    "traits": ["general"],
    "description": "Your eyes are keen beyond those of most mortals. You gain a +2 circumstance bonus to Perception checks to Seek hidden or undetected creatures within 30 feet of you.",
    "prerequisites": "Master in Perception"
  },
  {
    "id": "legendary-survivalist",
    "name": "Legendary Survivalist",
    "level": 15,
    "traits": ["general"],
    "description": "You can survive indefinitely without food or water, and you can go without air for 10 minutes without suffocating. If you're legendary in Survival, your expertise keeps you alive in the harshest conditions.",
    "prerequisites": "Legendary in Survival"
  }
]
